read_verilog fifo_cond.v

hierarchy -check -top fifo_cond

proc; opt; fsm; opt; memory; opt

techmap; opt

dfflibmap -liberty cmos_cells.lib

abc -liberty cmos_cells.lib

clean

write_verilog fifo_synth.v